Tekla.Structures.DirectManipulation.Adapter.DebugToolInvoker
The Tekla.Structures.DirectManipulation.Adapter.DebugToolInvoker class invokes the debug tool when requested
by an event named Tekla.Structures.DirectManipulation.Adapter.EventRegistry.StateEvents.StartDebugFeature which is received from Tekla.Structures.DirectManipulation.Adapter.EventRegistry.

Tekla.Structures.DirectManipulation.Adapter.DebugToolInvoker.AutostartAdvancedOption
The System.String identifier for the advanced option indicating whether
the debug tool must be autostarted on TS start-up.

Tekla.Structures.DirectManipulation.Adapter.DebugToolInvoker.doInvokeTool
A lazily initialized delegate to the method which can invoke the debug tool,
the delegate may be null if Tekla.Structures.DirectManipulation.Adapter.DebugToolInvoker.GetInvocationMethod failed.

Tekla.Structures.DirectManipulation.Adapter.DebugToolInvoker.Initialize
Initializes the Tekla.Structures.DirectManipulation.Adapter.DebugToolInvoker class,
triggers Tekla.Structures.DirectManipulation.Adapter.DebugToolInvoker to start listening for invocation events.

Tekla.Structures.DirectManipulation.Adapter.DebugToolInvoker.GetInvocationMethod
Gets a delegate to the method which can invoke the debug tool.
Remarks:
The invocation method is retrieved via reflection, otherwise the assemblies would have a circular dependency.
In theory the debug tool should be part of the Tekla.Structures.DirectManipulation project,
but that would introduce the requirement for the platform to allow the adapter to look at the internal functionality.
Such accessibility might make development in the adapter confusing.
Returns: A delegate to the method which can invoke the debug tool; or null, in case of failure.

Tekla.Structures.DirectManipulation.Adapter.DebugToolInvoker.OnStartDebugFeature(System.String)
Invokes the debug tool by calling the value of Tekla.Structures.DirectManipulation.Adapter.DebugToolInvoker.doInvokeTool.
param: Ignored, expected to be Tekla.Structures.DirectManipulation.Adapter.EventRegistry.StateEvents.StartDebugFeature.